#!/bin/bash
# ===========================================================================
# Скрипт настройки и первичной настройки сервера
# ===========================================================================
# Скрипт выполняет следующие действия:
# 1. Установка необходимых программ
# 2. Создание дирректорий
# 3. Назначение переменных окружения
# 4. Создание дефолтных конфигов
# Примечание: проверка выполнялась на Ubuntu 22.04
# ===========================================================================

# ===========================================================================
# Проверка запуска от имени суперпользователя
# ===========================================================================
if [[ $(id -u) -ne 0 ]] ; then echo "Необходимо запустить от имени суперпользователя" ; exit 1 ; fi
# ===========================================================================

# ===========================================================================
# Назначение переменных для работы скрипта
# ===========================================================================
SCRIPT_PATH="$( cd -- "$(dirname "$0")" >/dev/null 2>&1 ; pwd -P )"
echo "Путь к домашней дирректории: $HOME"
echo "Имя пользователя: $USERNAME"
# ===========================================================================

# ===========================================================================
# Установка необходимых программ и компонентов
# ===========================================================================
# apt update && apt upgrade
# apt install wireguard awk
# ===========================================================================

# ===========================================================================
# Создание каталогов для работы сервера
# Все гаталоги создаются в домашней дирректории
# ===========================================================================
# mkdir -p $HOME/wg_server/keys # дирректория с ключами пользователей и сервера
# mkdir -p $HOME/wg_server/configs # дирректория с конфигами пользователей
# cp
# ===========================================================================
